# config.py

import os
from dotenv import load_dotenv

load_dotenv()

# ============================================================
# ТОКЕНЫ И ДОСТУПЫ (Загружаются из .env)
# ============================================================
API_TOKEN    = os.getenv('API_TOKEN')
NOTION_TOKEN = os.getenv('NOTION_TOKEN')
DATABASE_ID  = os.getenv('DATABASE_ID')

# ============================================================
# НАСТРОЙКИ БИЗНЕС-ЛОГИКИ
# ============================================================
ADMIN_ID  = 8620175706 # <--- Впишите сюда актуальный ID администратора
ADMIN_IDS = [8620175706]

SPECIALIZATIONS = {
    "💇‍♀️ Волосы":       {"services": ["Стрижка", "Окрашивание"],  "masters": ["Анна", "Мария", "Иван"]},
    "💅 Ногти":           {"services": ["Маникюр", "Педикюр"],      "masters": ["Ольга"]},
    "💆‍♀️ Косметология": {"services": ["Чистка лица", "Пилинг"],   "masters": ["Елена"]},
}

PRICES = {
    "Стрижка": 1500, "Окрашивание": 4000,
    "Маникюр": 1200, "Педикюр":     1400,
    "Чистка лица": 2500, "Пилинг":  2000,
}

LOYALTY = {3: 5, 5: 10, 10: 15}  # визитов -> скидка %

MASTERS_CHAT_IDS = {
    "Анна": 8620175706, "Мария": 8620175706, "Иван": 8620175706,
    "Ольга": 8620175706, "Елена": 8620175706,
}

TIME_SLOTS = [
    "10:00", "11:00", "12:00", "13:00", "14:00",
    "15:00", "16:00", "17:00", "18:00", "19:00"
]